;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【循环分支程序设计】本题共20分
;试编写一程序，比较两个以'$'结尾的字符串STRING1和STRING2所含字符是
;否相同(假设两个字符串的长度相等)。若相同则显示'MATCH'，若不相同则
;显示'NO MATCH'。
;要求源程序中包含完善的注释信息。做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
    STRING1 DB 'abcdefghijklmnouqrstuvwxyz$'
    STRING2 DB 'abcdefghijklmnouqrstuvwxYz$'
;-------------------------所需变量定义于两横线之间-------------------

;所需变量定义于此(做题时删除此行)

;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
START:
    MOV AX,DATAS
    MOV DS,AX
    MOV ES,AX
;--------------------------程序代码写于两横线之间---------------------

;程序代码写于此(做题时删除此行)

;-------------------------------------------------------------------------- 
    MOV AX,4C00H
    INT 21H
CODES ENDS
    END START