#include <stdio.h>
#include <math.h >
#define BJ 1000    //本金

int main(){
    //声明部分
    double p1, p2, p3, p4, p5;
    //第一问
    p1 = BJ * (1 + 5 * 0.03);
    //第二问
    p2 = (BJ * (1 + 0.021 * 2)) * (1 + 0.0275 * 3);
    //第三问
    p3= (BJ * (1 + 0.0275 * 3)) * (1 + 0.021 * 2);
    //第四问
    p4= BJ * pow(1+0.015,5);
    //第五问
    p5 = BJ * pow(1 + 0.0035 / 4, 4 * 5);

    //输出结果
    printf("一次存五年最后的本息之和为：%7.3f\n",p1);
    printf("先存两年，到期后再存三年的本息之和为:%7.3f\n",p2);
    printf("先存三年再存两年的本息之和为:%7.3f\n",p3);
    printf("存一年期，到期后将本息再存一年，连续存五次的本息之和为:%7.3f\n",p4);
    printf("存活期存款，五年后的本息之和为:%7.3f\n",p5);
    
    return 0;
}