;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【顺序结构程序设计】本题共20分
;假设x、y、z 均为8字节带符号整数，依次存放在地址为X, X+2, X+4,X+6； Y, Y+2, 
;Y+4, Y+6 ；Z, Z+2, Z+4, Z+6的字存储单元中，存放时高位字在高地址，
;低位字在低地址。编程序计算w = x + y + 24 - z,  并用W, W+2, W+4, W+6
;字单元存放结果w（不考虑数据溢出问题）。处理完毕显示'OK!'信息。
;要求源程序中包含完善的注释信息。做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
	X	DW 1122,3344,5566,7788
	Y 	DW 2233,4455,6677,8899
	Z	DW 1234,5678,4321,8765
;-------------------------所需变量定义于两横线之间-------------------

;所需变量定义于此(做题时删除此行)

;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
START:
    MOV AX,DATAS
    MOV DS,AX
    MOV ES,AX
;--------------------------程序代码写于两横线之间---------------------

;程序代码写于此(做题时删除此行)

;--------------------------------------------------------------------------
;其它处理（代码略） 
	MOV AH,9
	MOV DX, OFFSET Ok
	INT 21H
    MOV AX,4C00H
    INT 21H
CODES ENDS
    END START