;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【综合应用程序设计】本题共40分
;编写程序，从键盘输入一个十进制整数（0-65535），然后把它以十六进制
;形式显示出来。并满足下列要求:
;（1）必须使用子程序结构；
;（2）要求程序运行时有友好的提示信息;
;（3）要求源程序中包含完善的注释信息。
;注意：做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
	Prompt1 DB 'Please Enter 1 Number(0-65535): $';请输入1个数
	Prompt2 DB 0dh,0ah,'Its Hexadecimal Representation is: $'
	ErrMsg  DB 0dh,0ah,'Overflow error for data! Try Again: $' ;数据溢出错误
;-------------------------所需变量定义于两横线之间-------------------
	
;所需变量定义于此	(做题时删除此行)
	
;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
;--------------------------程序代码写于两横线之间---------------------

;程序代码写于此(做题时删除此行)

;-------------------------------------------------------------------------- 
CODES ENDS
    END Main
