;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【循环分支程序设计】本题共20分
;已知数组A包含15个互不相等的整数，数组B包含20个互不相等的整数。
;试编制一程序，把即在A中又在B中出现的整数存放于数组C中。处理完毕
;显示'Processing Completed!'信息。
;要求源程序中包含完善的注释信息。做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
    A DW 15 DUP(?)
    B DW 20 DUP(?)
;--------------------------所需变量定义于两横线之间------------------

;所需变量定义于此(做题时删除此行)

;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
START:
    MOV AX,DATAS
    MOV DS,AX
    MOV ES,AX
;初始化数组A和B（代码略）
;---------------------------程序代码写于两横线之间-------------------

;程序代码写于此(做题时删除此行)

;------------------------------------------------------------------------
;其它处理（代码略）
	MOV AH,9
	MOV DX,OFFSET Completed
	INT 21H
    MOV AX,4C00H
    INT 21H
CODES ENDS
    END START
    