;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【综合应用程序设计】本题共40分
;编写一程序，从键盘输入一系列字符(以回车符结束)，并按字母、数字及其
;他字符分类计数，最后以十进制形式显示出这三类的计数结果。并满足下列要求:
;（1）必须使用子程序结构；
;（2）要求程序运行时有友好的提示信息;
;（3）要求源程序中包含完善的注释信息。
;注意：做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
	LettNumber    DB  0dh,0ah,'Number of letters is :$'
	DigiNumber    DB  0dh,0ah,'Number of digits is :$'
	OtherNumber   DB  0dh,0ah,'Number of other characters is :$'
	PromptMsg	  DB 'Plase Enter a String:',0dh,0ah,'$'
;-------------------------所需变量定义于两横线之间-------------------

;所需变量定义于此(做题时删除此行)

;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
;--------------------------程序代码写于两横线之间---------------------

;程序代码写于此(做题时删除此行)

;-------------------------------------------------------------------------- 
CODES ENDS
    END Main