;************************************************************************
;请把下一行注释中的XXX、YYYYYY改成你的姓名和学号
;姓名:XXX, 学号:YYYYYY
;【顺序结构程序设计】本题共20分
;假设x、y、r、w均为16位带符号整数，分别保存于字单元X、Y、R和W字存储
;单元。编写程序计算(w * x - 50) * 16 /(y + 6), 余数保存于字单元R中，
;商保存于字单元Z中。(假设(w * x - 50) * 16 不会超过32位带符号数表
;示范围，y+6不会超过16位带符号数表示范围)。要求乘以16必须使用移位
;运算实现，处理完毕显示'OK!'信息。
;要求源程序中包含完善的注释信息。做题时不要损坏题中原有的注释线。
;************************************************************************
DATAS SEGMENT
	X	DW 22
	Y 	DW 2233
	R	DW ?
	W	DW 8765
;-------------------------所需变量定义于两横线之间-------------------

;所需变量定义于此(做题时删除此行)

;------------------------------------------------------------------------
DATAS ENDS

CODES SEGMENT
    ASSUME CS:CODES,DS:DATAS,ES:DATAS
START:
    MOV AX,DATAS
    MOV DS,AX
    MOV ES,AX
;--------------------------程序代码写于两横线之间---------------------

;程序代码写于此(做题时删除此行)

;--------------------------------------------------------------------------
;其它处理（代码略） 
	MOV AH,9
	MOV DX, OFFSET Ok
	INT 21H
    MOV AX,4C00H
    INT 21H
CODES ENDS
    END START